app/Controllers/Buku.php

SELECT *
FROM `buku`
---
    public function index()
    {
        $cari = $this->request->getGet('cari');
        $data = [
            'buku'  => ($cari) ? $this->bukuModel->cariData($cari) : $this->bukuModel->findAll(),
            'cari'  => $cari,
            'title' => 'Katalog Buku'
        ];