app/Controllers/Peminjaman.php

SELECT `peminjaman`.*, `buku`.`judul`, `buku`.`id_buku`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
ORDER BY `id_pinjam` DESC
UPDATE `peminjaman` SET `denda` = 20000
WHERE `peminjaman`.`id_pinjam` IN ('72')
---
    public function index()
    {
        $all_pinjaman = $this->pinjamanModel->select('peminjaman.*, buku.judul, buku.id_buku')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
            ->orderBy('id_pinjam', 'DESC')
            ->findAll();

        $today = new \DateTime(date('Y-m-d'));
        $denda_per_hari = 5000;

        foreach ($all_pinjaman as &$p) {
            if ($p['status'] == 'dipinjam' && !empty($p['tanggal_kembali'])) {
                $batas_kembali = new \DateTime($p['tanggal_kembali']);

                if ($today > $batas_kembali) {
                    $selisih = $today->diff($batas_kembali);
                    $hari_terlambat = $selisih->days;
                    $total_denda = $hari_terlambat * $denda_per_hari;

                    if ($p['denda'] != $total_denda) {
                        $p['denda'] = $total_denda;
                        $this->pinjamanModel->update($p['id_pinjam'], ['denda' => $total_denda]);