app/Controllers/Users.php

    public function index()
    {
        // Proteksi Admin/Petugas
        $role = strtolower(session()->get('role') ?? '');
        if ($role != 'admin' && $role != 'petugas') {
            return redirect()->to('/dashboard')->with('error', 'Akses Ditolak!');
        }

        $data = [
            'users' => $this->users->findAll(),
            'cari'  => ''
        ];
---
SELECT *
FROM `users`

    public function store()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'nama'     => 'required',
            'username' => 'required|is_unique[users.username]',
            'password' => 'required|min_length[4]',
            'role'     => 'required',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->with('error', implode('<br>', $validation->getErrors()));
        }

        $foto = $this->request->getFile('foto');
        $namaFoto = null;
        if ($foto && $foto->isValid() && !$foto->hasMoved()) {
            $namaFoto = $foto->getRandomName();
            $foto->move(FCPATH . 'uploads/users', $namaFoto);
        }

        $this->users->save([
            'nama'     => $this->request->getPost('nama'),
            'username' => $this->request->getPost('username'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'role'     => $this->request->getPost('role'),
            'foto'     => $namaFoto
        ]);
---
INSERT INTO `users` (`nama`, `username`, `password`, `role`, `foto`) VALUES ('Didit Fathul', 'didit13', '$2y$10$.dpb6L/i5l1cwDNQxixQteGpaYPxIdsjBXZYearDcPkkjnVIWYfHS', 'admin', '1777379010_7ee834680f1495d40c4c.jpg')